In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('student_marks.csv')

In [4]:
df

     Student_Name  Maths  Physics  Chemistry  Computer_Science
0     Arjun Singh   49.0     55.0       48.0              80.0
1       Arjun Das   94.0     98.0       45.0              68.0
2    Vivaan Singh   95.0     40.0        NaN              49.0
3    Vivaan Patel   85.0      NaN       47.0               NaN
4       Sai Gupta    NaN      NaN        NaN              92.0
5     Aarav Mehta   87.0      NaN       78.0              66.0
6    Suresh Gupta   70.0     92.0        NaN               NaN
7    Aditya Patel   51.0     40.0        NaN              47.0
8     Rahul Reddy    NaN     51.0        NaN              83.0
9     Rahul Singh    NaN     56.0       90.0              55.0
10    Rahul Kumar    NaN      NaN       46.0               NaN
11        Sai Das   52.0      NaN        NaN               NaN
12  Karthik Reddy   36.0      NaN       83.0               NaN
13  Aditya Sharma   72.0     87.0        NaN               NaN
14   Nikhil Patel    NaN      NaN        NaN              76.0
15    Aarav Reddy    NaN      NaN       89.0              63.0
16    Rahul Singh   73.0     37.0        NaN              92.0
17  Karthik Kumar    NaN     68.0       63.0              58.0
18    Rahul Mehta   75.0     72.0        NaN              38.0
19    Vivaan Iyer   95.0      NaN        NaN               NaN
20      Sai Gupta   37.0      NaN       47.0              53.0
21    Rohan Verma    NaN      NaN        NaN               NaN
22    Arjun Gupta    NaN     49.0        NaN              98.0
23    Rohan Singh    NaN     50.0        NaN              67.0
24    Aarav Gupta    NaN     99.0        NaN              55.0
25   Suresh Kumar   90.0     64.0        NaN               NaN
26   Aditya Mehta   59.0     85.0       39.0              76.0
27    Aditya Iyer    NaN     78.0       92.0               NaN
28     Arjun Iyer   93.0     91.0        NaN               NaN
29  Karthik Gupta    NaN      NaN        NaN              88.0
30   Vivaan Patel   47.0      NaN        NaN              98.0
31     Sai Sharma    NaN     42.0        NaN               NaN
32   Vivaan Verma    NaN      NaN        NaN              98.0
33    Rahul Singh    NaN      NaN        NaN              88.0
34    Rahul Verma   43.0      NaN       77.0               NaN
35   Aditya Singh    NaN      NaN       60.0              57.0
36    Arjun Gupta   35.0     41.0        NaN              88.0
37    Rohan Verma   36.0      NaN        NaN              38.0
38    Aarav Gupta    NaN      NaN        NaN               NaN
39   Suresh Mehta    NaN      NaN       35.0              73.0
40   Suresh Gupta   49.0     98.0       48.0               NaN
41   Aditya Verma   75.0      NaN        NaN               NaN
42      Rohan Das    NaN     92.0       82.0              56.0
43    Arjun Verma   39.0     56.0       57.0               NaN
44  Karthik Kumar   52.0      NaN       69.0              62.0
45   Suresh Kumar    NaN     94.0        NaN               NaN
46   Nikhil Verma   90.0      NaN        NaN              93.0
47      Arjun Das    NaN      NaN        NaN              49.0
48    Rohan Gupta   37.0      NaN        NaN              85.0
49    Aarav Reddy    NaN     44.0        NaN               NaN

In [5]:
df.head()

   Student_Name  Maths  Physics  Chemistry  Computer_Science
0   Arjun Singh   49.0     55.0       48.0              80.0
1     Arjun Das   94.0     98.0       45.0              68.0
2  Vivaan Singh   95.0     40.0        NaN              49.0
3  Vivaan Patel   85.0      NaN       47.0               NaN
4     Sai Gupta    NaN      NaN        NaN              92.0

In [6]:
df.head(3)

   Student_Name  Maths  Physics  Chemistry  Computer_Science
0   Arjun Singh   49.0     55.0       48.0              80.0
1     Arjun Das   94.0     98.0       45.0              68.0
2  Vivaan Singh   95.0     40.0        NaN              49.0

In [7]:
df.tail()

    Student_Name  Maths  Physics  Chemistry  Computer_Science
45  Suresh Kumar    NaN     94.0        NaN               NaN
46  Nikhil Verma   90.0      NaN        NaN              93.0
47     Arjun Das    NaN      NaN        NaN              49.0
48   Rohan Gupta   37.0      NaN        NaN              85.0
49   Aarav Reddy    NaN     44.0        NaN               NaN

In [8]:
df.tail(2)

   Student_Name  Maths  Physics  Chemistry  Computer_Science
48  Rohan Gupta   37.0      NaN        NaN              85.0
49  Aarav Reddy    NaN     44.0        NaN               NaN

In [10]:
df.shape

(50, 5)

In [11]:
df.dtypes

Student_Name            str
Maths               float64
Physics             float64
Chemistry           float64
Computer_Science    float64
dtype: object

In [12]:
df.columns

Index(['Student_Name', 'Maths', 'Physics', 'Chemistry', 'Computer_Science'], dtype='str')

In [15]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Student_Name      50 non-null     str
 1   Maths             27 non-null     float64
 2   Physics           25 non-null     float64
 3   Chemistry         19 non-null     float64
 4   Computer_Science  31 non-null     float64
dtypes: float64(4), str(1)
memory usage: 2.1 KB

In [16]:
df.describe()

           Maths    Physics  Chemistry  Computer_Science
count  27.000000  25.000000  19.000000         31.000000
mean   63.555556  67.160000  62.894737         70.612903
std    21.976094  22.195495  18.920579         18.469213
min    35.000000  37.000000  35.000000         38.000000
25%    45.000000  49.000000  47.000000         55.500000
50%    59.000000  64.000000  60.000000         68.000000
75%    86.000000  91.000000  80.000000         88.000000
max    95.000000  99.000000  92.000000         98.000000

In [19]:
df.describe(include = 'all')

       Student_Name      Maths    Physics  Chemistry  Computer_Science
count            50  27.000000  25.000000  19.000000         31.000000
unique           38        NaN        NaN        NaN               NaN
top     Rahul Singh        NaN        NaN        NaN               NaN
freq              3        NaN        NaN        NaN               NaN
mean            NaN  63.555556  67.160000  62.894737         70.612903
std             NaN  21.976094  22.195495  18.920579         18.469213
min             NaN  35.000000  37.000000  35.000000         38.000000
25%             NaN  45.000000  49.000000  47.000000         55.500000
50%             NaN  59.000000  64.000000  60.000000         68.000000
75%             NaN  86.000000  91.000000  80.000000         88.000000
max             NaN  95.000000  99.000000  92.000000         98.000000

In [20]:
df.isnull()

    Student_Name  Maths  Physics  Chemistry  Computer_Science
0          False  False    False      False             False
1          False  False    False      False             False
2          False  False    False       True             False
3          False  False     True      False              True
4          False   True     True       True             False
5          False  False     True      False             False
6          False  False    False       True              True
7          False  False    False       True             False
8          False   True    False       True             False
9          False   True    False      False             False
10         False   True     True      False              True
11         False  False     True       True              True
12         False  False     True      False              True
13         False  False    False       True              True
14         False   True     True       True             False
15         False   True     True      False             False
16         False  False    False       True             False
17         False   True    False      False             False
18         False  False    False       True             False
19         False  False     True       True              True
20         False  False     True      False             False
21         False   True     True       True              True
22         False   True    False       True             False
23         False   True    False       True             False
24         False   True    False       True             False
25         False  False    False       True              True
26         False  False    False      False             False
27         False   True    False      False              True
28         False  False    False       True              True
29         False   True     True       True             False
30         False  False     True       True             False
31         False   True    False       True              True
32         False   True     True       True             False
33         False   True     True       True             False
34         False  False     True      False              True
35         False   True     True      False             False
36         False  False    False       True             False
37         False  False     True       True             False
38         False   True     True       True              True
39         False   True     True      False             False
40         False  False    False      False              True
41         False  False     True       True              True
42         False   True    False      False             False
43         False  False    False      False              True
44         False  False     True      False             False
45         False   True    False       True              True
46         False  False     True       True             False
47         False   True     True       True             False
48         False  False     True       True             False
49         False   True    False       True              True

In [21]:
df.isnull().sum()

Student_Name         0
Maths               23
Physics             25
Chemistry           31
Computer_Science    19
dtype: int64

In [22]:
df.isnull().sum().sum()

np.int64(98)

In [23]:
df['Student_Name'].unique()

<StringArray>
[  'Arjun Singh',     'Arjun Das',  'Vivaan Singh',  'Vivaan Patel',
     'Sai Gupta',   'Aarav Mehta',  'Suresh Gupta',  'Aditya Patel',
   'Rahul Reddy',   'Rahul Singh',   'Rahul Kumar',       'Sai Das',
 'Karthik Reddy', 'Aditya Sharma',  'Nikhil Patel',   'Aarav Reddy',
 'Karthik Kumar',   'Rahul Mehta',   'Vivaan Iyer',   'Rohan Verma',
   'Arjun Gupta',   'Rohan Singh',   'Aarav Gupta',  'Suresh Kumar',
  'Aditya Mehta',   'Aditya Iyer',    'Arjun Iyer', 'Karthik Gupta',
    'Sai Sharma',  'Vivaan Verma',   'Rahul Verma',  'Aditya Singh',
  'Suresh Mehta',  'Aditya Verma',     'Rohan Das',   'Arjun Verma',
  'Nikhil Verma',   'Rohan Gupta']
Length: 38, dtype: str

In [24]:
df['Maths'].unique()

array([49., 94., 95., 85., nan, 87., 70., 51., 52., 36., 72., 73., 75.,
       37., 90., 59., 93., 47., 43., 35., 39.])

In [26]:
df['Student_Name'].value_counts()

Student_Name
Rahul Singh      3
Arjun Das        2
Vivaan Patel     2
Sai Gupta        2
Suresh Gupta     2
Aarav Reddy      2
Karthik Kumar    2
Rohan Verma      2
Arjun Gupta      2
Aarav Gupta      2
Suresh Kumar     2
Arjun Singh      1
Vivaan Singh     1
Aarav Mehta      1
Aditya Patel     1
Rahul Reddy      1
Rahul Kumar      1
Sai Das          1
Karthik Reddy    1
Aditya Sharma    1
Nikhil Patel     1
Rahul Mehta      1
Vivaan Iyer      1
Rohan Singh      1
Aditya Mehta     1
Aditya Iyer      1
Arjun Iyer       1
Karthik Gupta    1
Sai Sharma       1
Vivaan Verma     1
Rahul Verma      1
Aditya Singh     1
Suresh Mehta     1
Aditya Verma     1
Rohan Das        1
Arjun Verma      1
Nikhil Verma     1
Rohan Gupta      1
Name: count, dtype: int64

In [28]:
df['Physics'].value_counts()

Physics
98.0    2
40.0    2
92.0    2
56.0    2
55.0    1
51.0    1
87.0    1
37.0    1
68.0    1
72.0    1
49.0    1
50.0    1
99.0    1
64.0    1
85.0    1
78.0    1
91.0    1
42.0    1
41.0    1
94.0    1
44.0    1
Name: count, dtype: int64

In [30]:
df['Physics'].value_counts(normalize = True)

Physics
98.0    0.08
40.0    0.08
92.0    0.08
56.0    0.08
55.0    0.04
51.0    0.04
87.0    0.04
37.0    0.04
68.0    0.04
72.0    0.04
49.0    0.04
50.0    0.04
99.0    0.04
64.0    0.04
85.0    0.04
78.0    0.04
91.0    0.04
42.0    0.04
41.0    0.04
94.0    0.04
44.0    0.04
Name: proportion, dtype: float64